# საკლასო დავალება: შექმენით სია, რომელშიც იქნება 10 ელემენტი. 

# შემდეგ მომხმარებელს შემოატანინეთ რიცხვი და შეინახეთ მთელი რიცხვის სახით.

# თუ ეს რიცხვი მეტია ან ტოლია 0-ზე და ნაკლებია სიის სიგრძეზე, მაშინ სიიდან ამ ინდექსზე მყოფი ელემენტი წამოიღეთ და დაბეჭდეთ.

# თუ ეს რიცხვი მეტია ან ტოლია "სიის სიგრძე გამრავლებული -1ზე" და ნაკლებია ან ტოლია -1 ზე, მაშინ დაბეჭდეთ ამ ინდექსზე მყოფი ელემენტი


# my_list = ["apple", "banana", "cherry", "date", "fig", "grape", "kiwi", "lemon", "mango", "orange"]
# user_input = input("შეიტანეთ რიცხვი: ")
# if user_input.isdigit() or (user_input.startswith("-") and user_input[1:].isdigit()):
#     index = int(user_input)
#     if 0 <= index < 10:
#         print(my_list[index])
#     elif -10 <= index <= -1:
#         print(my_list[index])
#     else:
#         print("მითითებული ინდექსი სიის ფარგლებს გარეთაა.")


# საკლასო დავალება: მოცემულია სია list1 = [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]. გადაუარეთ სიას და დაბეჭდეთ მისი ელემენტი გამრავლებული 2-ზე, ასევე გაყოფილი 2-ზე


list1 = [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

for element in list1:
    print("გამრავლებული 2-ზე:", element * 2)
    print("გაყოფილი 2-ზე:", element / 2)
